emacs/config.org
#+TITLE:Amuzak's Emacs Config
#+AUTHOR: Amuzak
#+DESCRIPTION: Amuzak's (Rishav's) personal Emacs config.
#+STARTUP: showeverything
#+OPTIONS: toc:1

* TOC                                                                   :toc:
- [[#important-programs-to-load-first][IMPORTANT PROGRAMS TO LOAD FIRST]]
  - [[#package-manager][Package Manager]]
  - [[#load-evil-mode][Load Evil Mode]]
  - [[#general-keybindings][General Keybindings]]
- [[#emacs-properties][EMACS PROPERTIES]]
  - [[#automatic-pairing][Automatic pairing]]
  - [[#automatic-trim-whitespace][Automatic trim whitespace]]
  - [[#automatic-clear-multiple-blank-lines][Automatic clear multiple blank lines]]
  - [[#custom-highlight-color][Custom highlight color]]
  - [[#dired-properties][Dired properties]]
  - [[#set-backup-directory-to-one-source][Set backup directory to one source]]
  - [[#increase-gc-threshold][Increase GC Threshold]]
  - [[#make-searches-like-neovim][Make Searches like Neovim]]
- [[#fonts][FONTS]]
  - [[#default-fonts][Default Fonts]]
  - [[#zooming-inout][Zooming In/Out]]
  - [[#fixing-emacs-paragraphs][Fixing Emacs Paragraphs]]
  - [[#all-the-icons][All The Icons]]
  - [[#nerd-fonts][Nerd Fonts]]
- [[#gui-tweaks][GUI TWEAKS]]
  - [[#disable-menubar-toolbar-scrollbar][Disable Menubar, Toolbar, Scrollbar]]
  - [[#display-line-numbers-truncated-lines][Display Line Numbers, Truncated Lines]]
  - [[#color-theme][Color Theme]]
  - [[#yank-on-highlight][Yank on highlight]]
  - [[#scroll-behavior][Scroll behavior]]
  - [[#rainbow-indent-and-jelly-cursor][Rainbow indent and Jelly cursor]]
- [[#which-key][WHICH-KEY]]
- [[#org-mode][ORG MODE]]
  - [[#enabling-toc][Enabling ToC]]
  - [[#enabling-org-bullets][Enabling Org Bullets]]
  - [[#disable-electric-indent][Disable Electric Indent]]
  - [[#fix-linting-if-scrolling-from-bottom][Fix Linting if scrolling from bottom]]
  - [[#automatic-code-blocks-per-language][Automatic Code Blocks Per Language]]
  - [[#modern-org][Modern Org]]
  - [[#centering-org-mode][Centering Org Mode]]
- [[#dashboard][DASHBOARD]]
- [[#terminal][TERMINAL]]
- [[#vertico][VERTICO]]
- [[#misc][MISC]]
  - [[#grease][Grease]]
  - [[#undo-fu][Undo-Fu]]
  - [[#surround][Surround]]
  - [[#commenter][Commenter]]

* IMPORTANT PROGRAMS TO LOAD FIRST

** Package Manager

#+begin_src emacs-lisp
  (defvar elpaca-installer-version 0.12)
  (defvar elpaca-directory (expand-file-name "elpaca/" user-emacs-directory))
  (defvar elpaca-builds-directory (expand-file-name "builds/" elpaca-directory))
  (defvar elpaca-sources-directory (expand-file-name "sources/" elpaca-directory))
  (defvar elpaca-order '(elpaca :repo "https://github.com/progfolio/elpaca.git"
                                :ref nil :depth 1 :inherit ignore
                                :files (:defaults "elpaca-test.el" (:exclude "extensions"))
                                :build (:not elpaca-activate)))
  (let* ((repo  (expand-file-name "elpaca/" elpaca-sources-directory))
         (build (expand-file-name "elpaca/" elpaca-builds-directory))
         (order (cdr elpaca-order))
         (default-directory repo))
    (add-to-list 'load-path (if (file-exists-p build) build repo))
    (unless (file-exists-p repo)
      (make-directory repo t)
      (when (<= emacs-major-version 28) (require 'subr-x))
      (condition-case-unless-debug err
          (if-let* ((buffer (pop-to-buffer-same-window "*elpaca-bootstrap*"))
                    ((zerop (apply #'call-process `("git" nil ,buffer t "clone"
                                                    ,@(when-let* ((depth (plist-get order :depth)))
                                                        (list (format "--depth=%d" depth) "--no-single-branch"))
                                                    ,(plist-get order :repo) ,repo))))
                    ((zerop (call-process "git" nil buffer t "checkout"
                                          (or (plist-get order :ref) "--"))))
                    (emacs (concat invocation-directory invocation-name))
                    ((zerop (call-process emacs nil buffer nil "-Q" "-L" "." "--batch"
                                          "--eval" "(byte-recompile-directory \".\" 0 'force)")))
                    ((require 'elpaca))
                    ((elpaca-generate-autoloads "elpaca" repo)))
              (progn (message "%s" (buffer-string)) (kill-buffer buffer))
            (error "%s" (with-current-buffer buffer (buffer-string))))
        ((error) (warn "%s" err) (delete-directory repo 'recursive))))
    (unless (require 'elpaca-autoloads nil t)
      (require 'elpaca)
      (elpaca-generate-autoloads "elpaca" repo)
      (let ((load-source-file-function nil)) (load "./elpaca-autoloads"))))
  (add-hook 'after-init-hook #'elpaca-process-queues)
  (elpaca `(,@elpaca-order))
  ;; Install use-package support
  (elpaca elpaca-use-package
    ;; Enable use-package :ensure support for Elpaca.
    (elpaca-use-package-mode))
#+end_src

** Load Evil Mode

#+begin_src emacs-lisp
  ;; Expands to: (elpaca evil (use-package evil :demand t))
  (use-package evil
    :ensure t
    :demand t
    :init
    (setq evil-want-integration t)
    (setq evil-want-keybinding nil)
    (setq evil-vsplit-window-right t)
    (setq evil-split-window-below t)
    (evil-mode)
    :config
    (evil-select-search-module 'evil-search-module 'evil-search)
    ;; QoL rebinds
    (define-key evil-normal-state-map "j" 'evil-next-visual-line)
    (define-key evil-normal-state-map "k" 'evil-previous-visual-line)
    (define-key evil-visual-state-map "j" 'evil-next-visual-line)
    (define-key evil-visual-state-map "k" 'evil-previous-visual-line)
    (define-key evil-visual-state-map (kbd "x") 'evil-delete)
    (define-key evil-normal-state-map (kbd "C-d") (lambda () (interactive) (evil-scroll-down nil) (recenter)))
    (define-key evil-normal-state-map (kbd "C-u") (lambda () (interactive) (evil-scroll-up nil) (recenter)))
    (define-key evil-normal-state-map "n" (lambda () (interactive) (evil-ex-search-next) (recenter)))
    (define-key evil-normal-state-map "N" (lambda () (interactive) (evil-ex-search-previous) (recenter)))
    (define-key evil-normal-state-map (kbd "<escape>") #'evil-ex-nohighlight)
    (define-key evil-normal-state-map "G" (lambda () (interactive) (evil-goto-line) (recenter)))
    (define-key evil-normal-state-map (kbd "<up>") (lambda () (interactive) (evil-window-increase-height 2)))
    (define-key evil-normal-state-map (kbd "<down>") (lambda () (interactive) (evil-window-decrease-height 2)))
    (define-key evil-normal-state-map (kbd "<left>") (lambda () (interactive) (evil-window-decrease-width 2)))
    (define-key evil-normal-state-map (kbd "<right>") (lambda () (interactive) (evil-window-increase-width 2)))
    (define-key evil-visual-state-map "<" (lambda () (interactive) (evil-shift-left (region-beginning) (region-end)) (evil-visual-restore)))
    (define-key evil-visual-state-map ">" (lambda () (interactive) (evil-shift-right (region-beginning) (region-end)) (evil-visual-restore)))
    (define-key evil-visual-state-map "p" (lambda () (interactive) (evil-delete (region-beginning) (region-end) 'line ?_) (evil-paste-after nil)))
    (define-key evil-normal-state-map (kbd "C-k") 'evil-window-up)
    (define-key evil-normal-state-map (kbd "C-j") 'evil-window-down)
    (define-key evil-normal-state-map (kbd "C-h") 'evil-window-left)
    (define-key evil-normal-state-map (kbd "C-l") 'evil-window-right)
    (evil-define-key 'normal org-mode-map (kbd "RET") 'org-open-at-point))

  (use-package evil-collection
    :ensure
    :demand t
    :after evil
    :config
    (setq evil-collection-mode-list '(dashboard dired ibuffer))
    (evil-collection-init))

  ;;Turns off elpaca-use-package-mode current declaration
  ;;Note this will cause evaluate the declaration immediately. It is not deferred.
  ;;Useful for configuring built-in emacs features.
  (use-package emacs :ensure nil :config (setq ring-bell-function #'ignore))

#+end_src

** General Keybindings

