emacs/config.el

(use-package general
  :ensure t
  :demand t
  :config
  (general-evil-setup)

  ;; 'SPC' as global leader key
  (general-create-definer amuzak/leader-keys
    :states '(normal insert visual emacs)
    :keymaps 'override
    :prefix "SPC"
    :global-prefix "C-SPC")

  ;; Buffer
  (amuzak/leader-keys
    "b" '(:ignore t :wk "Buffer")
    "b b" '(switch-to-buffer :wk "Switch buffer")
    "b i" '(ibuffer :wk "List active buffers")
    "b s" '(kill-this-buffer :wk "Kill this buffer")
    "b n" '(next-buffer :wk "Next buffer")
    "b p" '(previous-buffer :wk "Previous buffer")
    "b r" '(revert-buffer :wk "Reload buffer"))

  ;; Window
  (amuzak/leader-keys
    "v" '(evil-window-vsplit :wk "Split window vertically")
    "h" '(evil-window-split :wk "Split window horizontally")
    "se" '(balance-windows :wk "Make splits equal size")
    "xs" '(evil-window-delete :wk "Close current split"))

  ;; Evaluate
  (amuzak/leader-keys
    "e" '(:ignore t :wk "Evaluate")
    "e b" '(eval-buffer :wk "Evaluate elisp in buffer")
    "e d" '(eval-defun :wk "Evalute defun containing or after point")
    "e e" '(eval-expression :wk "Evalute an elisp expression")
    "e l" '(eval-last-sexp :wk "Evaluate elisp expression before point")
    "e r" '(eval-region :wk "Evaluate elisp in region"))

  ;; Emacs Utils
  (amuzak/leader-keys
    "d" '(:ignore t :wk "Help")
    "d f" '(describe-function :wk "Describe Function")
    "d v" '(describe-variable :wk "Describe Variable")
    "r r" '((lambda () (interactive) (load-file "~/.config/emacs/init.el")) :wk "Reload Emacs Config"))

  ;; Misc
  (amuzak/leader-keys
    "SPC" '(project-find-file :wk "Find file")
    "f r" '(counsel-recentf :wk "Find recent files")
    "c c" '((lambda () (interactive) (find-file "~/.config/emacs/config.org")) :wk "Edit Emacs Config")
    "a" (lambda () (interactive) (evil-goto-first-line) (evil-visual-line) (evil-goto-line))
    "d d" '(dashboard-open :wk "Open Dashboard")
    "l g" '(my/launch-lazygit :wk "Launch LazyGit")
    "ww" '((lambda () (interactive)
             (save-some-buffers t (lambda ()
  				    (and (buffer-modified-p)
  					 (not (string-match-p "\\*.*\\*" (buffer-name)))
  					 (not (eq major-mode 'comint-mode)))))
             (message "All files saved"))
  	   :wk "Save file(s)")
    "qq" '((lambda () (interactive)
             (save-some-buffers t (lambda ()
  				    (and (buffer-modified-p)
  					 (not (string-match-p "\\*.*\\*" (buffer-name)))
  					 (not (eq major-mode 'comint-mode)))))
             (message "All files saved, exiting...")
             (kill-emacs))
  	   :wk "Save all and quit"))

(general-define-key
 :states '(normal visual)
 "gcc" '(evilnc-comment-or-uncomment-lines :wk "Toggle comment")))

(electric-pair-mode 1)

(add-hook 'before-save-hook 'delete-trailing-whitespace)

(add-hook 'before-save-hook
          (lambda ()
            (save-excursion
              (goto-char (point-min))
              (while (re-search-forward "^\n+" nil t)
                (replace-match "\n")))))

(custom-set-faces
 '(region ((t (:background "#5f695f")))))

(set-language-environment "UTF-8")

(setq initial-buffer-choice "~/")

;; Map backspace to go up a directory in Dired
(with-eval-after-load 'dired
  (define-key dired-mode-map (kbd "<backspace>") 'dired-up-directory))

(setq gc-cons-threshold (* 100 1024 1024)) ; 100MB

(set-face-attribute 'default nil
		    :font "JetBrains Mono"
		    :height 110
		    :weight 'medium)
(set-face-attribute 'variable-pitch nil
		    :font "Ubuntu"
		    :height 120
		    :weight 'medium)
(set-face-attribute 'fixed-pitch nil
		    :font "JetBrains Mono"
		    :height 110
		    :weight 'medium)
(set-face-attribute 'font-lock-comment-face nil
		    :slant 'italic)
(set-face-attribute 'font-lock-keyword-face nil
		    :slant 'italic)
;; this will become useful once we move to the emacsclient
(add-to-list 'default-frame-alist '(font . "JetBrains Mono-11"))
(setq-default line-spacing 0.12)

(global-set-key (kbd "C-=") 'text-scale-increase)
(global-set-key (kbd "C--") 'text-scale-decrease)
(global-set-key (kbd "C-=") 'text-scale-increase)
(global-set-key (kbd "C--") 'text-scale-decrease)

(setq paragraph-start "\\([ \t]*$\\)\\|\\(^\\s-*$\\)")
(setq paragraph-separate "\\([ \t]*$\\)\\|\\(^\\s-*$\\)")

(use-package all-the-icons
  :ensure t
  :if (display-graphic-p))

(use-package nerd-icons
  :ensure t
  :config
  (setq nerd-icons-font-family "Symbols Nerd Font Mono"))

(use-package nerd-icons-dired
  :ensure t
  :hook (dired-mode . nerd-icons-dired-mode))

(menu-bar-mode -1)
(tool-bar-mode -1)
(scroll-bar-mode -1)
(setq display-line-numbers-type 'relative)

(global-display-line-numbers-mode 1)
(global-visual-line-mode t)

(use-package darktooth-theme
  :ensure (:host github :repo "emacsfodder/emacs-theme-darktooth")
  :config
  (load-theme 'darktooth t))

(use-package evil-goggles
  :ensure t
  :after evil
  :config
  (evil-goggles-mode)
  (setq evil-goggles-duration 0.25))

(setq scroll-conservatively 101)
(setq scroll-margin 5)
(pixel-scroll-precision-mode 1)

(use-package holo-layer
  :ensure (:host github :repo "manateelazycat/holo-layer")
  :init
  (setq holo-layer-python-command "~/scoop/apps/python/current/python.exe")
  (setq holo-layer-python-file
        (expand-file-name "elpaca/sources/holo-layer/holo_layer.py"
                          user-emacs-directory))
  (setq holo-layer-enable-cursor-animation t)
  (setq holo-layer-enable-indent-rainbow t)
  :config
  (holo-layer-enable))

(use-package which-key
  :init
  (which-key-mode 1)
  :config
  (setq which-key-side-window-location 'bottom
	which-key-sort-order #'which-key-key-order-alpha
	which-key-sort-uppercase-first nil
	which-key-add-column-padding 1
	which-key-max-display-columns nil
	which-key-min-display-lines 6
	which-key-side-window-slot -10
	which-key-side-window-max-height 0.25
	which-key-idle-delay 0.8
	which-key-max-description-length 25
	which-key-allow-imprecise-window-fit t
	which-key-separator " -> "))

(use-package toc-org
  :ensure t
  :commands toc-org-enable
  :init (add-hook 'org-mode-hook 'toc-org-enable))

(add-hook 'org-mode-hook 'org-indent-mode)
(use-package org-superstar
  :ensure (:host github :repo "integral-dw/org-superstar-mode")
  :hook (org-mode . org-superstar-mode))

(electric-indent-mode -1)

(require 'org-tempo)

(add-hook 'org-mode-hook #'font-lock-fontify-buffer)

(add-to-list 'org-structure-template-alist '("se" . "src emacs-lisp"))
(add-to-list 'org-structure-template-alist '("sp" . "src python"))
(add-to-list 'org-structure-template-alist '("sr" . "src R"))
(add-to-list 'org-structure-template-alist '("sc" . "src clojure"))

(set-language-environment "UTF-8")
