emacs/config.org
** Modern Org

#+begin_src emacs-lisp
  (use-package org-modern
    :ensure t
    :hook (org-mode . org-modern-mode)
    :config
    (modify-all-frames-parameters
     '((right-divider-width . 0)
       (internal-border-width . 0)))
    (dolist (face '(window-divider
                    window-divider-first-pixel
                    window-divider-last-pixel))
      (face-spec-reset-face face)
      (set-face-foreground face (face-attribute 'default :background)))
    ;; (set-face-background 'fringe (face-attribute 'default :background))
    (set-face-background 'org-block (color-darken-name (face-attribute 'default :background) 30))
    (setq org-modern-todo-faces org-todo-keyword-faces)
    (setq org-modern-todo t)
    (setq org-modern-tag t)
    (setq org-modern-table t
  	org-ellipsis " "
  	org-modern-block-fringe nil))

  (use-package org-modern-indent
    :ensure (:host github :repo "jdtsmith/org-modern-indent")
    :config ; add late to hook
    (org-modern-indent-mode 1)
    (add-hook 'org-mode-hook #'org-modern-indent-mode t))
#+end_src

** Centering Org Mode

#+begin_src emacs-lisp
  (use-package olivetti
    :ensure t
    :diminish olivetti-mode
    :bind (("<left-margin> <mouse-1>" . ignore)
           ("<right-margin> <mouse-1>" . ignore)
           ("C-c {" . olivetti-shrink)
           ("C-c }" . olivetti-expand)
           ("C-c |" . olivetti-set-width))
    :custom
    (olivetti-body-width 0.65)          ; 70% of window width
    (olivetti-minimum-body-width 80)   ; Minimum width in characters
    (olivetti-recall-visual-line-mode-entry-state t)
    :hook
    ((markdown-mode . olivetti-mode)
     (org-mode . olivetti-mode)))

  (defun my/olivetti-only-when-single-window ()
    "Enable Olivetti mode only when there is a single window."
    (if (= (count-windows) 1)
        (olivetti-mode 1)
      (olivetti-mode -1)))

  ;; (add-hook 'window-configuration-change-hook
  ;;           #'my/olivetti-only-when-single-window)
#+end_src

* DASHBOARD

#+begin_src emacs-lisp
  (set-language-environment "UTF-8")
  (use-package dashboard
    :ensure t
    :after nerd-icons
    :init
    (setq dashboard-center-content t)
    (setq dashboard-icon-type 'nerd-icons)
    (setq dashboard-display-icons-p t)
    (setq dashboard-set-heading-icons t)
    (setq dashboard-set-file-icons t)
    (setq dashboard-items '((recents . 5)
                            (agenda . 5)
                            (bookmarks . 5)
                            (projects . 5)))
    :config
    (add-hook 'elpaca-after-init-hook #'dashboard-insert-startupify-lists)
    (add-hook 'elpaca-after-init-hook #'dashboard-initialize)
    (dashboard-setup-startup-hook))
  (with-eval-after-load 'dashboard
    (defun my/dashboard-replace-displayable (str)
      str)
    (advice-add 'dashboard-replace-displayable :override #'my/dashboard-replace-displayable))
#+end_src

* TERMINAL

They are still figuring out terminal support for windows and emacs in the year of our lord 2026

In the meantime

#+begin_src emacs-lisp
  (global-set-key (kbd "C-/") #'my/launch-shell)
  (defun my/launch-shell ()
    "Launch WezTerm in the project root or current directory."
    (interactive)
    (let ((dir (or (project-root (project-current)) default-directory)))
      (call-process "wezterm" nil 0 nil
                    "start" "--cwd" (expand-file-name dir)
                    "pwsh" "-NoLogo")))
  (global-set-key (kbd "C-/") #'my/launch-shell)
#+end_src

Also magit is way too slow on Windows, so I'm sticking with lazygit for now

Maybe once I can move out of Windows this will be easier

#+begin_src emacs-lisp
  (defun my/launch-lazygit ()
    "Launch lazygit in WezTerm from the current buffer's directory."
    (interactive)
    (let ((dir (expand-file-name default-directory)))
      (start-process "wezterm-lazygit" nil
                     "wezterm" "start"
                     "--cwd" dir
                     "lazygit")))
#+end_src

* VERTICO

Better M-x minibuffer

#+begin_src emacs-lisp
  ;; Vertico - vertical completion UI
  (use-package vertico
    :ensure t
    :init
    (vertico-mode))

  ;; Persist history across sessions (vertico sorts by recency)
  (use-package savehist
    :init
    (savehist-mode))

  ;; Orderless - fuzzy/flex matching similar to telescope
  (use-package orderless
    :ensure t
    :custom
    (completion-styles '(orderless flex basic))
    (completion-category-overrides '((file (styles orderless basic partial-completion)))))

  ;; Marginalia - annotations in the minibuffer (file size, docstrings, etc.)
  (use-package marginalia
    :ensure t
    :init
    (marginalia-mode))

  ;; Nerd Icons for marginalia (requires nerd-icons and a patched font)
  (use-package nerd-icons-completion
    :ensure t
    :after marginalia
    :config
    (nerd-icons-completion-mode)
    (add-hook 'marginalia-mode-hook #'nerd-icons-completion-marginalia-setup))
#+end_src

* MISC

** Grease

The Oil.nvim substitute

#+begin_src emacs-lisp
  (use-package grease
    :ensure (:host github :repo "mwac-dev/grease.el")
    :commands (grease-open grease-toggle grease-here))
#+end_src

** Undo-Fu

Proper vim like linear undo redo system

#+begin_src emacs-lisp
  (use-package undo-fu
    :elpaca t)

  (setq evil-undo-system 'undo-fu)

  (with-eval-after-load 'evil
    (define-key evil-normal-state-map (kbd "C-r") 'evil-redo))
#+end_src

** Surround

Nvim Surround Capabilities

#+begin_src emacs-lisp
  (use-package evil-surround
    :ensure t
    :config
    (global-evil-surround-mode 1))
#+end_src

** Commenter

Proper commenting functionality

#+begin_src emacs-lisp
  (use-package evil-nerd-commenter
    :ensure (:host github :repo "redguardtoo/evil-nerd-commenter"))
#+end_src
