emacs/config.el
(use-package dashboard
  :ensure t
  :after nerd-icons
  :init
  (setq dashboard-center-content t)
  (setq dashboard-icon-type 'nerd-icons)
  (setq dashboard-display-icons-p t)
  (setq dashboard-set-heading-icons t)
  (setq dashboard-set-file-icons t)
  (setq dashboard-items '((recents . 5)
                          (agenda . 5)
                          (bookmarks . 5)
                          (projects . 5)))
  :config
  (add-hook 'elpaca-after-init-hook #'dashboard-insert-startupify-lists)
  (add-hook 'elpaca-after-init-hook #'dashboard-initialize)
  (dashboard-setup-startup-hook))
(with-eval-after-load 'dashboard
  (defun my/dashboard-replace-displayable (str)
    str)
  (advice-add 'dashboard-replace-displayable :override #'my/dashboard-replace-displayable))

(global-set-key (kbd "C-/") #'my/launch-shell)
(defun my/launch-shell ()
  "Launch WezTerm in the project root or current directory."
  (interactive)
  (let ((dir (or (project-root (project-current)) default-directory)))
    (call-process "wezterm" nil 0 nil
                  "start" "--cwd" (expand-file-name dir)
                  "pwsh" "-NoLogo")))
(global-set-key (kbd "C-/") #'my/launch-shell)

(defun my/launch-lazygit ()
  "Launch lazygit in WezTerm from the current buffer's directory."
  (interactive)
  (let ((dir (expand-file-name default-directory)))
    (start-process "wezterm-lazygit" nil
                   "wezterm" "start"
                   "--cwd" dir
                   "lazygit")))

;; Vertico - vertical completion UI
(use-package vertico
  :ensure t
  :init
  (vertico-mode))

;; Persist history across sessions (vertico sorts by recency)
(use-package savehist
  :init
  (savehist-mode))

;; Orderless - fuzzy/flex matching similar to telescope
(use-package orderless
  :ensure t
  :custom
  (completion-styles '(orderless flex basic))
  (completion-category-overrides '((file (styles orderless basic partial-completion)))))

;; Marginalia - annotations in the minibuffer (file size, docstrings, etc.)
(use-package marginalia
  :ensure t
  :init
  (marginalia-mode))

;; Nerd Icons for marginalia (requires nerd-icons and a patched font)
(use-package nerd-icons-completion
  :ensure t
  :after marginalia
  :config
  (nerd-icons-completion-mode)
  (add-hook 'marginalia-mode-hook #'nerd-icons-completion-marginalia-setup))

(use-package grease
  :ensure (:host github :repo "mwac-dev/grease.el")
  :commands (grease-open grease-toggle grease-here))

(use-package undo-fu
  :elpaca t)

(setq evil-undo-system 'undo-fu)

(with-eval-after-load 'evil
  (define-key evil-normal-state-map (kbd "C-r") 'evil-redo))

(use-package evil-surround
  :ensure t
  :config
  (global-evil-surround-mode 1))

(use-package evil-nerd-commenter
  :ensure (:host github :repo "redguardtoo/evil-nerd-commenter"))
